# Taps
tap "valkyrie00/bbrew"

# ==============================================================================
# BLUEFIN / PREINSTALLED
# (Based on "Bluefin builtin" and "bluefin cli experience")
# ==============================================================================

# --- BREW (CLI Tools) ---
brew "atuin"
brew "bash-preexec"
brew "bat"
brew "valkyrie00/bbrew/bbrew"
brew "chezmoi"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "stress-ng"
brew "tealdeer"
brew "television"
brew "trash-cli"
brew "ugrep"
brew "uutils-coreutils"
brew "yq"
brew "zoxide"

# --- FLATPAK (GUI Apps) ---
flatpak "com.github.rafostar.Clapper"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.mattjakeman.ExtensionManager"
flatpak "io.github.flattool.Ignition"
flatpak "io.github.flattool.Warehouse"
flatpak "io.github.getnf.embellish"
flatpak "io.gitlab.adhami3310.Impression"
flatpak "io.missioncenter.MissionCenter"
flatpak "io.podman_desktop.PodmanDesktop"
flatpak "me.iepure.devtoolbox"
flatpak "org.gnome.Calculator"
flatpak "org.gnome.Calendar"
flatpak "org.gnome.Characters"
flatpak "org.gnome.Connections"
flatpak "org.gnome.Contacts"
flatpak "org.gnome.DejaDup"
flatpak "org.gnome.FileRoller"
flatpak "org.gnome.Firmware"
flatpak "org.gnome.Logs"
flatpak "org.gnome.Loupe"
flatpak "org.gnome.Maps"
flatpak "org.gnome.NautilusPreviewer"
flatpak "org.gnome.Papers"
flatpak "org.gnome.TextEditor"
flatpak "org.gnome.Weather"
flatpak "org.gnome.World.PikaBackup"
flatpak "org.gnome.baobab"
flatpak "org.gnome.clocks"
flatpak "org.gnome.font-viewer"
flatpak "page.tesk.Refine"
flatpak "sh.loft.devpod"

# --- CASKS (Fonts) ---
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-zed-mono-nerd-font"

# --- VSCODE EXTENSIONS ---
vscode "evondev.dracula-high-contrast"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "omthemes.omthemes"


# ==============================================================================
# USER INSTALLED / FTWYNN
# (Items chosen manually)
# ==============================================================================

# --- BREW (CLI Tools) ---
brew "btop"
brew "devcontainer"
brew "dust"
brew "gemini-cli"
brew "git"
brew "helix"
brew "k9s"
brew "lazydocker"
brew "lazygit"
brew "mask"
brew "presenterm"
brew "stow"
brew "yazi"
brew "zellij"

# --- FLATPAK (GUI Apps) ---
flatpak "com.calibre_ebook.calibre"
flatpak "com.discordapp.Discord"
flatpak "com.github.PintaProject.Pinta"
flatpak "com.github.marhkb.Pods"
flatpak "com.github.xournalpp.xournalpp"
flatpak "com.github.zocker_160.SyncThingy"
flatpak "com.google.Chrome"
flatpak "com.slack.Slack"
flatpak "com.spotify.Client"
flatpak "com.vivaldi.Vivaldi"
flatpak "dev.zed.Zed"
flatpak "io.github.input_leap.input-leap"
flatpak "io.github.kolunmi.Bazaar"
flatpak "io.github.sigmasd.stimulator"
flatpak "io.lmms.LMMS"
flatpak "md.obsidian.Obsidian"
flatpak "net.scribus.Scribus"
flatpak "org.audacityteam.Audacity"
flatpak "org.blender.Blender"
flatpak "org.flameshot.Flameshot"
flatpak "org.gnome.gitlab.johannesjh.favagtk"
flatpak "org.gnome.meld"
flatpak "org.kde.kdenlive"
flatpak "org.kde.krita"
flatpak "org.videolan.VLC"
flatpak "org.zulip.Zulip"
flatpak "com.github.marktext.marktext"
