// bluefin cli experience
atuin
brotli
dysk
gmp
lz4
python@3.14
stress-ng
uutils-coreutils
bash
bzip2
expat
libedit
mpdecimal
readline
tealdeer
xz
bash-preexec
ca-certificates
eza
libffi
ncurses
ripgrep
television
yq
bat
chezmoi
fd
libgit2
oniguruma
shellcheck
trash-cli
zlib
bbrew
dbus
gh
libssh2
openssl@3
sqlite
ugrep
zoxide
berkeley-db@5
direnv
glab
libxcrypt
pcre2
starship
unzip
zstd
icu4c@77

// FTWynn
stow
lazygit
lazydocker
k9s
btop
helix
dust
yazi
mask
presenterm
git
gemini-cli
devcontainer
zellij
