// Bluefin builtin
com.github.rafostar.Clapper
com.github.tchx84.Flatseal
com.mattjakeman.ExtensionManager
io.github.flattool.Ignition
io.github.flattool.Warehouse
io.gitlab.adhami3310.Impression
io.missioncenter.MissionCenter
org.gnome.Calculator
org.gnome.Calendar
org.gnome.Contacts
org.gnome.Characters
org.gnome.Connections
org.gnome.DejaDup
org.gnome.FileRoller
org.gnome.Firmware
org.gnome.Logs
org.gnome.Loupe
org.gnome.Maps
org.gnome.NautilusPreviewer
org.gnome.Papers
org.gnome.TextEditor
org.gnome.Weather
org.gnome.World.PikaBackup
org.gnome.baobab
org.gnome.clocks
org.gnome.font-viewer
//org.mozilla.Thunderbird
//org.mozilla.firefox
page.tesk.Refine
io.podman_desktop.PodmanDesktop
me.iepure.devtoolbox
io.github.getnf.embellish
sh.loft.devpod


// FTWynn
com.vivaldi.Vivaldi
md.obsidian.Obsidian
io.github.input_leap.input-leap
com.discordapp.Discord
org.zulip.Zulip
com.spotify.Client
com.google.Chrome
com.slack.Slack
io.github.sigmasd.stimulator
io.github.martchus.syncthingtray
dev.zed.Zed
org.flameshot.Flameshot
org.gnome.gitlab.johannesjh.favagtk
com.github.xournalpp.xournalpp
org.kde.krita
org.blender.Blender
org.kde.kdenlive
com.obsproject.Studio
net.scribus.Scribus
com.github.PintaProject.Pinta
io.lmms.LMMS
org.audacityteam.Audacity
org.videolan.VLC
com.calibre_ebook.calibre
io.github.kolunmi.Bazaar
com.github.marhkb.Pods
org.gnome.meld
org.gtk.Gtk3theme.Adwaita-dark
